app/controllers/admin/events_controller.rb

  def index
    @events = Event.paginate(:all,
                             :order => 'conferences.name, start_at desc',
                             :joins => 'left outer join conferences on events.conference_id = conferences.id',
                             :page => params[:page])
---
SELECT "events".* FROM "events" left outer join conferences on events.conference_id = conferences.id ORDER BY conferences.name, start_at desc LIMIT 10 OFFSET 0

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 6)