app/controllers/admin/videos_controller.rb

  def index
    @videos = Video.paginate(:all,
                             :order => "recorded_at desc",
                             :page => params[:page])
---
SELECT * FROM "videos" ORDER BY recorded_at desc LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "videos"

  def edit
    @events = Event.find(:all,
                         :order => "start_at desc")

    @video = Video.find(params[:id])
    @presenters = Presenter.find(:all, :order => 'last_name, first_name')
    if @video.assets.count == 0
      @video.assets.build
    end
    @asset_types = AssetType.find(:all, :order => 'description')
    @rooms = Room.find(:all, :conditions => ['event_id = ?', @video.event.id])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)
SELECT * FROM "videos" WHERE ("videos"."id" = 10)
SELECT * FROM "assets" WHERE ("assets".video_id = 10)

  def new
    # TODO: Sort by Conference.name then Year desc
    @events = Event.find(:all,
                         :order => "start_at desc")
---
SELECT * FROM "events" WHERE ("events"."id" = 6)

  def create
    @video = Video.create(params[:video])

    if @video.save then
      flash[:success] = "The video was created successfully."
      if params[:commit] == "Save" && @video.errors.nil?
        redirect_to event_path(@video.event)
      else
        flash[:success] += "<br>Adding another..."
        @events = Event.find(:all,
                             :order => "start_at desc")
---
INSERT INTO "videos" ("created_at", "title", "recorded_at", "event_id", "available", "display_format", "prefix", "updated_at", "override") VALUES('2010-07-14 04:18:43', 'test with asset', '2010-07-14 04:00:00', 6, 't', 'HD', '', '2010-07-14 04:18:43', '')
SELECT * FROM "events" WHERE ("events"."id" = 6)

  def update
    @video = Video.find(params[:id])
---
SELECT * FROM "videos" WHERE ("videos"."id" = 10)