app/controllers/main_controller.rb

  def home_page
    recents

    if params[:id].nil?
      @video = Video.random
    else
      @video = Video.find(params[:id])
---
SELECT * FROM "videos" WHERE (available = 't') ORDER BY random() LIMIT 1